nc: 5
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, BiFPNFuse, [2]]
  - [-1, 1, MSDC, []]
  - [-1, 1, CGA, []]
  - [-1, 1, SGA, [7]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, BiFPNFuse, [2]]
  - [-1, 1, MSDC, []]
  - [-1, 1, CGA, []]
  - [-1, 1, SGA, [7]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 1, BiFPNFuse, [2]]
  - [-1, 1, MSDC, []]
  - [-1, 1, CGA, []]
  - [-1, 1, SGA, [7]]
  - [-1, 2, C3k2, [128, False]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 24], 1, Concat, [1]]
  - [-1, 1, BiFPNFuse, [2]]
  - [-1, 1, MSDC, []]
  - [-1, 1, CGA, []]
  - [-1, 1, SGA, [7]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 1, BiFPNFuse, [2]]
  - [-1, 1, MSDC, []]
  - [-1, 1, CGA, []]
  - [-1, 1, SGA, [7]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, BiFPNFuse, [2]]
  - [-1, 1, MSDC, []]
  - [-1, 1, CGA, []]
  - [-1, 1, SGA, [7]]
  - [-1, 2, C3k2, [1024, True]]

  - [[31, 38, 45, 52], 1, Segment, [nc, 32, 256]]
